test/assets/vcr_cassettes/comission_calculation_test/capture.yml

---
http_interactions:
- request:
    method: post
    uri: https://sk_test_r0wxkPFASg9e45UIakAhgpru:@api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=2875&currency=usd&card[number]=4242424242424242&card[exp_month]=5&card[exp_year]=2015&card[cvc]=411&card[name]=User-2+User-2&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.43.1&capture=false
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.43.1
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.43.1","lang":"ruby","lang_version":"2.0.0 p451 (2014-02-24)","platform":"x86_64-darwin12.5.0","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 30 May 2014 01:06:25 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '987'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Stripe-Version:
      - '2014-03-28'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1047uI4jC1s34dJWtIeRUNwg",
          "object": "charge",
          "created": 1401411985,
          "livemode": false,
          "paid": true,
          "amount": 2875,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_1047uI4jC1s34dJWa0DgrgwF",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 5,
            "exp_year": 2015,
            "fingerprint": "mFydmlYyN8amTBcD",
            "country": "US",
            "name": "User-2 User-2",
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null,
            "customer": null
          },
          "captured": false,
          "refunds": [],
          "balance_transaction": null,
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_description": null
        }
    http_version: 
  recorded_at: Fri, 30 May 2014 01:06:25 GMT
recorded_with: VCR 2.4.0
